import styles from "./NotFound.module.css";
import { Link } from "wouter";

function NotFound({ params }) {
  return (
    <main className={styles["not-found"]}>
      <p>
        <b>404:</b> Страница <code>"/{params["*"]}"</code> не найдена!
      </p>
      <code align="center">
        <br />
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀
        <br />⠀ ⠀ ⠀⠀⠀⠀⠀⢠⠐⠲⢠⣿⣿⣿⣿⣿⡿⢛⣻⣿⣿⣶⣄⠀⠀⠀⠀⠀
        <br /> ⠀ ⠀⠀⠀⠀⣴⣿⡦⢀⣾⣿⣿⣿⣿⠿⢫⡀⠀⢈⣉⣻⣿⣷⣤⡀⠀⠀
        <br />
        ⠀⠀⠀⠀⠙⣉⠡⠿⠻⠿⠿⠟⣋⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀
        <br /> ⠀ ⠀⠀⠀⠀⢈⣿⣆⠀⢀⣤⣴⣿⣿⡿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀⠀
        <br /> ⠀ ⠀⠀⠀⣴⣿⣿⣿⣃⣛⣿⣿⡿⠂⢀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀
        <br />⠀ ⣰⣿⣿⣿⠚⣷⣧⣿⣿⢿⣿⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀
        <br />
        ⢰⣿⣿⡿⠱⠇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢿⢧
        <br />⠀ ⢰⡏⣿⡇⠻⣷⣌⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⢻⣷⣜⠄
        <br />
        ⠆⢁⣉⣴⣷⣌⢿⣷⡜⣿⣿⣿⣿⡟⣠⣬⣙⢿⣯⡙⢿⣿⣿⣿⣿⣿⢸⣿⣿⡌
        <br />
        ⠘⢌⢿⣿⣿⣿⣆⢻⣷⢸⣿⣿⣿⡇⢻⣿⣿⣧⡹⣿⣌⢻⣿⣿⠟⡁⣼⣿⣿⡇ <br />⠀ ⠀⠠⡻⣿⣿⣿⢸⡟⣠⢍⡛⠻⠷⠸⣿⣿⣿⣷⠸⣿⡆⢋⠥⠈⠇⠟⣡⠏⠀{" "}
        <br />
        ⠀⠀⠈⠊⠍⠩⠄⠂⠀⠀⠀⠀⠀⢠⢻⣿⣿⣿⡇⣿⡇⠀⠀⠀⠈⠐⠐⠊ <br />
        ⠀⠀⠀⠀⠀⠀⠀ ⠁⢝⠻⠿⠇⢛⠐ <br />
      </code>
      <Link href="/">Обратно к товарам</Link>
    </main>
  );
}

export default NotFound;
